IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.

DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 WS-NUM PIC 9(3). *> GIVE GRADE
   88 PASS VALUES ARE 041 THRU 99.
   88 FAIL VALUES ARE 0 THRU 40.
   01 WS-LOW PIC 9(3).
   01 WS-HIGH PIC 9(3).
   01 WS-MID PIC 9(3).

PROCEDURE DIVISION.
   A000-FIRST-PARA.
   DISPLAY 'GIVE YOUR SCORE IN FORMAT X% WITH X BEING BETWEEN 0-100'
   ACCEPT WS-NUM.
   MOVE 50 TO WS-LOW.
   MOVE 75 TO WS-MID.
   MOVE 100 TO WS-HIGH.
   
   IF WS-NUM > WS-LOW THEN
   IF WS-NUM < WS-MID THEN
   IF WS-NUM < WS-HIGH THEN
   DISPLAY 'GRADE: 3'
   ELSE
   DISPLAY 'GRADE: 5'
   END-IF
   ELSE
   DISPLAY 'GRADE: 4'
   END-IF
   ELSE
   DISPLAY 'GRADE: 2'
   END-IF
   
STOP RUN.